CommunityGD32Cores/gd32-pio-spl-package/gd32/cmsis/variants/gd32a50x/system_gd32a50x.c
#elif defined (__SYSTEM_CLOCK_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_HXTAL;
static void system_clock_hxtal(void);
#elif defined (__SYSTEM_CLOCK_24M_PLL_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_24M_PLL_HXTAL;
static void system_clock_24m_pll_hxtal(void);
#elif defined (__SYSTEM_CLOCK_48M_PLL_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_48M_PLL_HXTAL;
static void system_clock_48m_pll_hxtal(void);
#elif defined (__SYSTEM_CLOCK_72M_PLL_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_72M_PLL_HXTAL;
static void system_clock_72m_pll_hxtal(void);
#elif defined (__SYSTEM_CLOCK_100M_PLL_HXTAL)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_100M_PLL_HXTAL;
static void system_clock_100m_pll_hxtal(void);
#endif /* __SYSTEM_CLOCK_IRC8M */

/* configure the system clock */
static void system_clock_config(void);

/*!
    \brief      setup the micro-controller system, initialize the system
    \param[in]  none
    \param[out] none
    \retval     none
*/
void SystemInit(void)
{
    /* FPU settings */
#if (__FPU_PRESENT == 1U) && (__FPU_USED == 1U)
    SCB->CPACR |= ((3UL << 10 * 2) | (3UL << 11 * 2)); /* set CP10 and CP11 Full Access */
#endif
    /* reset the RCU clock configuration to the default reset state */
    /* set IRC8MEN bit */
    RCU_CTL |= RCU_CTL_IRC8MEN;

    if(((RCU_CFG0 & RCU_CFG0_SCSS) == RCU_SCSS_PLL)){
        RCU_MODIFY_DE_3(0x100);
    }
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    /* reset HXTALSCAL, LCKMEN, PLLMEN, PLLEN, CKMEN and HXTALEN bits */
    RCU_CTL &= ~(RCU_CTL_PLLEN | RCU_CTL_CKMEN | RCU_CTL_HXTALEN | RCU_CTL_HXTALSCAL | RCU_CTL_LCKMEN | RCU_CTL_PLLMEN);
    /* disable all interrupts */
    RCU_INT = 0x00FF0000U;

    /* Reset CFG0 and CFG1 registers */
    RCU_CFG0 = 0x00020000U;
    RCU_CFG1 = 0x00000000U;

    /* reset HXTALBPS bit */
    RCU_CTL &= ~(RCU_CTL_HXTALBPS);

    /* configure HXTALSCAL according to HXTAL_VALUE */
    if(HXTAL_VALUE > 8000000U) {
        RCU_CTL |= RCU_CTL_HXTALSCAL;
    }

    /* configure the system clock source, PLL Multiplier, AHB/APBx prescalers and Flash settings */
    system_clock_config();

    /* LXTALBPS configuration */
    if(0U == (RCU_APB1EN & RCU_APB1EN_PMUEN)) {
        /* check whether PMU clock is enabled */
        RCU_APB1EN |= RCU_APB1EN_PMUEN;
        if(0U == (PMU_CTL & PMU_CTL_BKPWEN)) {
            /* BKPWEN bit is not been set */
            PMU_CTL |= PMU_CTL_BKPWEN;
            /* LXTALBPS bit must be configured to 1 */
            RCU_BDCTL |= RCU_BDCTL_LXTALBPS;
            /* clear the BKPWEN bit */
            PMU_CTL &= ~PMU_CTL_BKPWEN;
        } else {
            /* LXTALBPS bit must be configured to 1 */
            RCU_BDCTL |= RCU_BDCTL_LXTALBPS;
        }

        /* disable the PMU clock */
        RCU_APB1EN &= ~RCU_APB1EN_PMUEN;
    } else {
        /* the PMU clock is already enabled */
        if(0U == (PMU_CTL & PMU_CTL_BKPWEN)) {
            /* BKPWEN bit is not been set */
            PMU_CTL |= PMU_CTL_BKPWEN;
            /* LXTALBPS bit must be configured to 1 */
            RCU_BDCTL |= RCU_BDCTL_LXTALBPS;
            /* clear the BKPWEN bit */
            PMU_CTL &= ~PMU_CTL_BKPWEN;
        } else {
            /* LXTALBPS bit must be configured to 1 */
            RCU_BDCTL |= RCU_BDCTL_LXTALBPS;
        }
    }

#ifdef VECT_TAB_SRAM
    nvic_vector_table_set(NVIC_VECTTAB_RAM, VECT_TAB_OFFSET);
#else
    nvic_vector_table_set(NVIC_VECTTAB_FLASH, VECT_TAB_OFFSET);
#endif
}

/*!
    \brief      configure the system clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_config(void)
{
#ifdef __SYSTEM_CLOCK_IRC8M
    system_clock_8m_irc8m();
#elif defined (__SYSTEM_CLOCK_24M_PLL_IRC8M)
    system_clock_24m_pll_irc8m();
#elif defined (__SYSTEM_CLOCK_48M_PLL_IRC8M)
    system_clock_48m_pll_irc8m();
#elif defined (__SYSTEM_CLOCK_72M_PLL_IRC8M)
    system_clock_72m_pll_irc8m();
#elif defined (__SYSTEM_CLOCK_100M_PLL_IRC8M)
    system_clock_100m_pll_irc8m();

#elif defined (__SYSTEM_CLOCK_HXTAL)
    system_clock_hxtal();
#elif defined (__SYSTEM_CLOCK_24M_PLL_HXTAL)
    system_clock_24m_pll_hxtal();
#elif defined (__SYSTEM_CLOCK_48M_PLL_HXTAL)
    system_clock_48m_pll_hxtal();
#elif defined (__SYSTEM_CLOCK_72M_PLL_HXTAL)
    system_clock_72m_pll_hxtal();
#elif defined (__SYSTEM_CLOCK_100M_PLL_HXTAL)
    system_clock_100m_pll_hxtal();
#endif /* __SYSTEM_CLOCK_IRC8M */
}

#ifdef __SYSTEM_CLOCK_IRC8M
/*!
    \brief      configure the system clock to 8M by IRC8M
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_8m_irc8m(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;

    /* enable IRC8M */
    RCU_CTL |= RCU_CTL_IRC8MEN;

    /* wait until IRC8M is stable or the startup time is longer than IRC8M_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_IRC8MSTB);
    } while((0U == stab_flag) && (IRC8M_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_IRC8MSTB)) {
        while(1) {
        }
    }

    FMC_WS = (FMC_WS & (~FMC_WS_WSCNT)) | WS_WSCNT(0);

    RCU_APB1EN |= RCU_APB1EN_PMUEN;

    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
    /* APB2 = AHB/1 */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV1;
    /* APB1 = AHB/1 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV1;

    /* select IRC8M as system clock */
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    RCU_CFG0 |= RCU_CKSYSSRC_IRC8M;

    /* wait until IRC8M is selected as system clock */
    while((RCU_CFG0 & RCU_CFG0_SCSS) != RCU_SCSS_IRC8M) {
    }
}
/*!
    \brief      configure the system clock to 24M by PLL which selects IRC8M as its clock source
    \param[in]  none
    \param[out] none
    \retval     none
*/
#elif defined (__SYSTEM_CLOCK_24M_PLL_IRC8M)
static void system_clock_24m_pll_irc8m(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;

    /* enable IRC8M */
    RCU_CTL |= RCU_CTL_IRC8MEN;

    /* wait until IRC8M is stable or the startup time is longer than IRC8M_STARTUP_TIMEOUT */
    do {
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_IRC8MSTB);
    } while((0U == stab_flag) && (IRC8M_STARTUP_TIMEOUT != timeout));

